// ДЗ 13. Gaming cards ♠️♣️♥️♦️
// Рисуем колоду карт, которая состоит из:
// карт номиналом 2-10 всех мастей
// карт jack, queen, king всех мастей
// карт тузов всех мастей
// В макете используется:
// Шрифт https://fonts.google.com/specimen/Nerko+One
// Зеленый цвет доски #55aa55
// Черный цвет текста #353c4d
// Иконки 4-x мастей и jack, queen, king в архиве images.zip
// Все теги рендерим с помощью js.
// Внешний вид задания НЕ важен, важен только JS-код))

card = [];
number [2, 3, 4, 5, 6, 7, 8, 9, 10, "Jack", "Queen", "King", "T"];
suit = [`clubs`, `spades`, `diamond`, `hearts`];
icon